In [1]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt
% matplotlib inline

In [2]:
fifa = pd.read_csv('match_results.csv')

In [3]:
fifa.head(2)

,date,home_team,away_team,home_score,away_score,tournament,city,country,neutral
0,1872-11-30,Scotland,England,0,0,Friendly,Glasgow,Scotland,False
1,1873-03-08,England,Scotland,4,2,Friendly,London,England,False

In [4]:
fifa.shape

(38898, 9)

In [5]:
fifa.isnull().sum()

date          0
home_team     0
away_team     0
home_score    0
away_score    0
tournament    0
city          0
country       0
neutral       0
dtype: int64

In [6]:
fifa.dtypes

date          object
home_team     object
away_team     object
home_score     int64
away_score     int64
tournament    object
city          object
country       object
neutral         bool
dtype: object

In [7]:
fifa.head(5)

,date,home_team,away_team,home_score,away_score,tournament,city,country,neutral
0,1872-11-30,Scotland,England,0,0,Friendly,Glasgow,Scotland,False
1,1873-03-08,England,Scotland,4,2,Friendly,London,England,False
2,1874-03-07,Scotland,England,2,1,Friendly,Glasgow,Scotland,False
3,1875-03-06,England,Scotland,2,2,Friendly,London,England,False
4,1876-03-04,Scotland,England,3,0,Friendly,Glasgow,Scotland,False

In [11]:
fifa1 = fifa.iloc[:,[0,1,2,3,4]].copy()

In [12]:
fifa1.head(2)

         date home_team away_team  home_score  away_score
0  1872-11-30  Scotland   England           0           0
1  1873-03-08   England  Scotland           4           2

In [13]:
fifa1['date'] = pd.to_datetime(fifa1.date)

In [14]:
fifa1.dtypes

date          datetime64[ns]
home_team             object
away_team             object
home_score             int64
away_score             int64
dtype: object

In [15]:
fifa1['date1'] = fifa1.date.dt.year

In [16]:
fifa1.head()

        date home_team away_team  home_score  away_score  date1
0 1872-11-30  Scotland   England           0           0   1872
1 1873-03-08   England  Scotland           4           2   1873
2 1874-03-07  Scotland   England           2           1   1874
3 1875-03-06   England  Scotland           2           2   1875
4 1876-03-04  Scotland   England           3           0   1876

In [31]:
fifa2 = fifa1[fifa1['date1'].isin([2010, 2014, 2018]) ].copy()

In [32]:
fifa2.head(2)

            date home_team  away_team  home_score  away_score  date1
31408 2010-01-02      Iran  Korea DPR           1           0   2010
31409 2010-01-02     Qatar       Mali           0           0   2010

In [33]:
fifa2.shape

(1823, 6)

In [91]:
fifa_stats = pd.read_csv('fifa_players_data.csv')

In [96]:
fifa_stats['year'] = ('20' + fifa_stats['year'].astype(str)).astype(int)

In [97]:
fifa_stats.head(2)

,age,country_code,dob,full_name,image,nation,potential,rating,short_name,value,wage,year
0,26.0,7,"Jun 28, 1991",K. De Bruyne,https://cdn.sofifa.org/1x/18/players/192985.png,Belgium,92.0,91.0,K. De Bruyne,104.5,395.0,2018
1,26.0,7,"Jan 7, 1991",E. Hazard,https://cdn.sofifa.org/1x/18/players/183277.png,Belgium,91.0,91.0,E. Hazard,95.5,405.0,2018

In [98]:
fifa_agg = fifa_stats.loc[:,['nation','rating',
                  'year'] ].groupby(['nation', 'year']).mean()

In [99]:
fifarank = pd.read_csv('fifa_rank.csv')

In [100]:
fifarank.head()

  Unnamed: 0  Value of Starting 11  Fifa Ranking
0     Russia                   855            66
1     Brazil                   933             2
2       Iran                   778            36
3      Japan                   839            60
4     Mexico                   863            15

In [101]:
fifa_agg.head(1)

              rating
nation  year
Albania 2010    72.0

In [102]:
fifa2.head(1)

            date home_team  away_team  home_score  away_score  date1  label
31408 2010-01-02      Iran  Korea DPR           1           0   2010      0

In [103]:
fifa2['label'] = 2

In [104]:
index_label0 = fifa2[fifa2['home_score'] > fifa2['away_score']].index

In [105]:
index_label1 = fifa2[fifa2['home_score'] < fifa2['away_score']].index

In [106]:
fifa2.loc[index_label0,'label'] = 0

In [107]:
fifa2.loc[index_label1,'label'] = 1

In [108]:
fifa2.head()

            date home_team   away_team  home_score  away_score  date1  label
31408 2010-01-02      Iran   Korea DPR           1           0   2010      0
31409 2010-01-02     Qatar        Mali           0           0   2010      2
31410 2010-01-02     Syria    Zimbabwe           6           0   2010      0
31411 2010-01-02     Yemen  Tajikistan           0           1   2010      1
31412 2010-01-03    Angola      Gambia           1           1   2010      2

In [109]:
fifa_reset = fifa_agg.reset_index()

In [110]:
fifarank=fifarank.rename(columns={'Unnamed: 0': "Team"})

In [111]:
fifarank.head()

     Team  Value of Starting 11  Fifa Ranking
0  Russia                   855            66
1  Brazil                   933             2
2    Iran                   778            36
3   Japan                   839            60
4  Mexico                   863            15

In [112]:
fifa_reset[fifa_reset['nation'].str.contains('Korea')]

            nation  year     rating
50  Korea Republic  2010  63.272727
51  Korea Republic  2014  73.181818
52  Korea Republic  2018  74.909091

In [113]:
fifa_reset['nation'].unique()

array(['Albania', 'Algeria', 'Argentina', 'Australia', 'Belgium',
       'Bolivia', 'Brazil', 'Central African Rep.', 'Colombia',
       'Costa Rica', 'Croatia', 'Denmark', 'Egypt', 'England',
       'FYR Macedonia', 'France', 'Germany', 'Iceland', 'Iran', 'Japan',
       'Korea Republic', 'Mexico', 'Morocco', 'Nigeria', 'Panama', 'Peru',
       'Poland', 'Portugal', 'Russia', 'Saudi Arabia', 'Senegal',
       'Serbia', 'Spain', 'Sweden', 'Switzerland', 'Tunisia', 'Uruguay',
       'Venezuela'], dtype=object)

In [114]:
fifa_reset2 = fifa_reset.replace('Korea Republic', 'South Korea')

In [115]:
team_features=fifarank.merge(fifa_reset2, left_on="Team", right_on="nation", how='inner')
team_features['nation'].unique()

array(['Russia', 'Brazil', 'Iran', 'Japan', 'Mexico', 'Belgium',
       'South Korea', 'Saudi Arabia', 'Germany', 'England', 'Spain',
       'Nigeria', 'Costa Rica', 'Poland', 'Egypt', 'Iceland', 'Serbia',
       'Portugal', 'France', 'Uruguay', 'Argentina', 'Colombia', 'Panama',
       'Senegal', 'Morocco', 'Tunisia', 'Switzerland', 'Croatia',
       'Sweden', 'Denmark', 'Australia', 'Peru'], dtype=object)

In [116]:
team_fer=team_features.loc[:,['Team', 'Fifa Ranking', 'year', 'rating']]

In [117]:
fifa3=fifa2.loc[:,['home_team', 'away_team', 'date1', 'label']]
fifa3.head()

      home_team   away_team  date1  label
31408      Iran   Korea DPR   2010      0
31409     Qatar        Mali   2010      2
31410     Syria    Zimbabwe   2010      0
31411     Yemen  Tajikistan   2010      1
31412    Angola      Gambia   2010      2

In [128]:
fifa4=fifa3.merge(team_fer, left_on=["home_team", "date1"], right_on=["Team", "year"], how='inner')

In [129]:
team_fer['Team'].unique().shape

(32,)

In [130]:
team_fer[team_fer.year == 2018].shape

(32, 4)

In [131]:
fifa3['home_team'].unique().shape

(205,)

In [132]:
fifa5=fifa4.rename(columns={'Fifa Ranking': "home_rank", 'rating': 'home_rating'})

In [133]:
fifa6=fifa5.merge(team_fer, left_on=["away_team", "date1"], right_on=["Team", "year"], how='inner')

In [134]:
fifa7=fifa6.rename(columns={'Fifa Ranking': "away_rank", 'rating': 'away_rating', 'date1': 'year'})
fifa7.head()

,home_team,away_team,year,label,Team_x,home_rank,year_x,home_rating,Team_y,away_rank,year_y,away_rating
0,Iran,Brazil,2010,1,Iran,36,2010,71.400000,Brazil,2,2010,69.545455
1,Argentina,Brazil,2010,0,Argentina,5,2010,69.600000,Brazil,2,2010,69.545455
2,Portugal,Brazil,2010,2,Portugal,4,2010,69.818182,Brazil,2,2010,69.545455
3,Egypt,Nigeria,2010,0,Egypt,46,2010,65.888889,Nigeria,47,2010,63.909091
4,Argentina,Nigeria,2010,0,Argentina,5,2010,69.600000,Nigeria,47,2010,63.909091

In [135]:
fifa8=fifa7.loc[:,["year", "home_team", "away_team", "home_rank", "away_rank", "home_rating", "away_rating", "label"]]
fifa8.head()

,year,home_team,away_team,home_rank,away_rank,home_rating,away_rating,label
0,2010,Iran,Brazil,36,2,71.400000,69.545455,1
1,2010,Argentina,Brazil,5,2,69.600000,69.545455,0
2,2010,Portugal,Brazil,4,2,69.818182,69.545455,2
3,2010,Egypt,Nigeria,46,47,65.888889,63.909091,0
4,2010,Argentina,Nigeria,5,47,69.600000,63.909091,0

In [136]:
fifa8["rank_dif"]=fifa8.home_rank-fifa8.away_rank
fifa8.head()

,year,home_team,away_team,home_rank,away_rank,home_rating,away_rating,label,rank_dif
0,2010,Iran,Brazil,36,2,71.400000,69.545455,1,34
1,2010,Argentina,Brazil,5,2,69.600000,69.545455,0,3
2,2010,Portugal,Brazil,4,2,69.818182,69.545455,2,2
3,2010,Egypt,Nigeria,46,47,65.888889,63.909091,0,-1
4,2010,Argentina,Nigeria,5,47,69.600000,63.909091,0,-42

In [137]:
fifa8["rating_dif"]=fifa8.home_rating-fifa8.away_rating

In [138]:
fifa9=fifa8.loc[:,["year", "home_team", "away_team", "rank_dif", "rating_dif", "label"]]

In [139]:
fifa9

     year    home_team     away_team  rank_dif  rating_dif  label
0    2010         Iran        Brazil        34    1.854545      1
1    2010    Argentina        Brazil         3    0.054545      0
2    2010     Portugal        Brazil         2    0.272727      2
3    2010        Egypt       Nigeria        -1    1.979798      0
4    2010    Argentina       Nigeria       -42    5.690909      0
5    2010        Egypt     Australia        20    3.161616      0
6    2010       Poland     Australia       -16   -1.000000      1
7    2010      Germany     Australia       -25    3.545455      0
8    2010  Switzerland     Australia       -20    0.050505      2
9    2010      Tunisia        France         7   -3.878788      2
10   2010      England        France         6   -8.333333      1
11   2010      Uruguay        France        10    0.666667      2
12   2010      Nigeria      Colombia        31   -5.818182      2
13   2010       Mexico      Colombia        -1   -8.000000      0
14   2010    Argentina    Costa Rica       -20    4.054545      0
15   2010       France    Costa Rica       -18    1.787879      0
16   2010  Switzerland    Costa Rica       -19   -2.767677      1
17   2010       Panama    Costa Rica        30    2.454545      2
18   2010         Peru    Costa Rica       -14    1.181818      0
19   2010    Argentina        Mexico       -10    7.872727      0
20   2010      England        Mexico        -2   -2.727273      0
21   2010       France        Mexico        -8    5.606061      1
22   2010    Argentina       Germany         4    3.327273      1
23   2010      Belgium       Germany         2    4.727273      1
24   2010      Uruguay       Germany        16    1.727273      1
25   2010      Denmark       Germany        11    1.327273      2
26   2010       Sweden       Germany        22   -5.072727      2
27   2010    Argentina         Spain        -3    5.145455      0
28   2010       Mexico         Spain         7   -2.727273      2
29   2010       France         Spain        -1    2.878788      1
..    ...          ...           ...       ...         ...    ...
120  2014      Croatia        Mexico         3    4.272727      1
121  2014       Brazil        Mexico       -13    5.454545      2
122  2014       Sweden       Belgium        20   -8.181818      1
123  2014    Argentina       Belgium         2   -0.818182      0
124  2014       Brazil        Serbia       -33    4.454545      0
125  2014    Argentina          Iran       -31   12.389610      0
126  2014    Argentina   Switzerland        -1    7.000000      0
127  2014      Senegal         Egypt       -18    2.272727      0
128  2014      Tunisia         Egypt       -32   -1.272727      0
129  2018      Denmark        Sweden       -11    1.272727      1
130  2018      Denmark        Panama       -43   11.454545      0
131  2018  Switzerland        Panama       -49   10.636364      0
132  2018       Mexico       Iceland        -7    5.363636      0
133  2018         Peru       Iceland       -11    0.454545      0
134  2018       Mexico       Croatia        -3   -3.636364      1
135  2018         Peru       Croatia        -7   -8.545455      0
136  2018       France      Colombia        -9    4.545455      1
137  2018    Australia      Colombia        10   -7.090909      2
138  2018      Germany         Spain        -7    0.272727      2
139  2018      Germany        Brazil        -1    1.090909      1
140  2018       Russia        Brazil        64   -7.000000      1
141  2018       Poland       Nigeria       -37    4.727273      1
142  2018       Serbia       Nigeria       -12    4.454545      0
143  2018     Portugal         Egypt       -42    9.000000      0
144  2018       Russia        France        59   -6.454545      1
145  2018       Serbia       Morocco        -7    1.636364      1
146  2018      Tunisia          Iran       -22    0.545455      0
147  2018      Tunisia    Costa Rica       -11   -2.454545      0
148  2018      Belgium  Saudi Arabia       -67   12.909091      0
149  2018        Spain     Argentina         3    0.636364      0

[150 rows x 6 columns]

In [82]:
fifa9.to_csv("Training_fifa.csv",index=False)